# 全国市販酒類調査の結果について (平成30年度調査分)
# https://www.nta.go.jp/taxes/sake/shiori-gaikyo/seibun/06.htm

# 精米歩合については
# 清酒の製造状況等について (平成30酒造年度)
# https://www.nta.go.jp/taxes/sake/shiori-gaikyo/seizojokyo/07.htm

# 都道府県
都道府県名 <- c("北海道", "青森県", "岩手県", "宮城県", "秋田県", "山形県", "福島県", "茨城県", "栃木県", "群馬県", "埼玉県", "新潟県", "長野県", "千葉県", "東京都", "神奈川県", "山梨県", "富山県", "石川県", "福井県", "岐阜県", "静岡県", "愛知県", "三重県", "滋賀県", "京都府", "大阪府", "兵庫県", "奈良県", "和歌山県", "鳥取県", "島根県", "岡山県", "広島県", "山口県", "徳島県", "香川県", "愛媛県", "高知県", "福岡県", "佐賀県", "長崎県", "熊本県", "大分県", "宮崎県・鹿児島県・沖縄県")

# 一般酒
一般酒_都道府県_アルコール分 <- c(15.55, 15.23, 15.36, 14.7, 15.05, 15.64, 15.18, 15.44, 15.4, 14.87, 14.63, 15.48, 15.13, 15.35, 15.35, 14.3, 15.2, 14.92, 14.93, 15.3, 15.3, 15.52, 15.22, 15.49, 15.55, 15.26, 16.08, 14.8, 15.4, 15.48, 15.3, 15.38, 14.88, 15.03, 15.4, 15.42, 15.68, 15.77, 15.14, 15.25, 15.58, 15.17, 15.22, 15.28, NA)

一般酒_都道府県_日本酒度 <- c(4.7, 2.6, 5.2, -0.8, 3.5, 3.9, 3.6, 6, 2.5, 4.6, 3.7, 4.9, 5.1, 5, 4.1, 4.6, 4.5, 7.5, 3.4, 5.9, 4, 4.6, 3.5, 3.2, 3.9, 2.9, 0.9, 2, 1.6, 4, 7, 5.4, 2.6, 0.9, 3.5, 2.8, 6, 4.7, 5.9, 2.8, 0.7, -0.9, 3.3, 0.9, NA)

一般酒_都道府県_エキス分 <- c(4.38, 4.7, 4.27, 5.15, 4.47, 4.59, 4.49, 4.13, 4.77, 4.2, 4.3, 4.32, 4.2, 4.32, 4.48, 4.08, 4.33, 3.7, 4.47, 4.1, 4.48, 4.4, 4.52, 4.67, 4.53, 4.64, 5.2, 4.67, 4.9, 4.5, 3.96, 4.26, 4.59, 4.93, 4.53, 4.72, 4.2, 4.47, 4.06, 4.67, 5.13, 5.3, 4.58, 5.03, NA)

一般酒_都道府県_酸度 <- c(1.17, 1.23, 1.17, 1.3, 1.26, 0.99, 1.04, 1.03, 1.16, 0.97, 0.93, 1.05, 1.1, 0.97, 1.1, 0.92, 1.03, 1.04, 1.25, 1.14, 1.32, 1.02, 1.18, 1.29, 1.25, 1.2, 1.15, 1.28, 1.16, 1.14, 1.18, 1.04, 1.01, 0.92, 1.03, 1.37, 1.3, 1.23, 1.2, 1.18, 1.19, 1.34, 1.22, 0.98, NA)

一般酒_都道府県_アミノ酸度 <- c(1.03, 1.07, 0.97, 1.55, 1.04, 0.93, 0.99, 1.09, 1.13, 0.93, 1.07, 1.11, 1.03, 1.1, 1.28, 1.58, 1.33, 1.18, 1.47, 1.38, 1.4, 1.44, 1.25, 1.24, 1.3, 1.14, 0.83, 1.34, 1.5, 1.08, 1.38, 1.5, 1.04, 1.03, 1.63, 1.5, 1.08, 1.17, 0.96, 1.51, 1.63, 1.49, 1.3, 1.03, NA)

一般酒_都道府県_甘辛度 <- c(-0.2, -0.08, -0.25, 0.15, -0.2, 0.08, 0.05, -0.16, 0.02, 0.05, 0.16, -0.08, -0.16, 0.01, -0.06, 0.1, -0.02, -0.31, -0.17, -0.28, -0.31, -0.02, -0.11, -0.2, -0.22, -0.07, 0.18, -0.08, 0.09, -0.1, -0.42, -0.11, 0.18, 0.44, 0.06, -0.26, -0.47, -0.27, -0.35, -0.03, 0.15, 0.11, -0.13, 0.37, NA)

一般酒_都道府県_濃淡度 <- c(-1.04, -0.82, -1.05, -0.54, -0.81, -1.34, -1.23, -1.36, -0.96, -1.41, -1.43, -1.28, -1.18, -1.43, -1.14, -1.5, -1.29, -1.4, -0.82, -1.14, -0.72, -1.31, -0.95, -0.75, -0.85, -0.9, -0.9, -0.71, -0.91, -1.06, -1.12, -1.31, -1.24, -1.34, -1.24, -0.58, -0.85, -0.91, -1.03, -0.94, -0.82, -0.46, -0.87, -1.23, NA)

# 茶、緑、青、その他色、R、紙、その他
一般酒_容器比率 <- c(73.1, 11.5, 0.3, 1.4, 2.1, 10.1, 1.3)

# 精米歩合
一般酒_精米歩合_平均 <- 73.6
一般酒_精米歩合_標準偏差 <- 3.3

# 吟醸酒
吟醸酒_都道府県_アルコール分 <- c(16.05, 15.43, 15.45, 15.37, 15.67, 15.76, 15.47, 15.73, 16, 15.57, 15.95, 15.5, 15.76, 16.12, 15.43, 15.58, 16.24, 15.4, 15.95, 15.6, 15.35, 15.98, 15.33, 15.66, 16.32, 15.62, 16.08, 15.5, 15.43, 16.06, 15.88, 15.46, 15.73, 15.71, 15.66, 15.58, 16.02, 16.14, 16.2, 15.64, 16.38, 15.27, 15.7, 16.27, 16.27)

吟醸酒_都道府県_日本酒度 <- c(2.2, 2.4, 2.4, 3.3, 2.6, 1.6, 1.6, 4.5, 1.8, 1.2, 4.1, 5.6, 3.1, 3.9, 2.3, 3.7, 2.4, 6.9, 3.1, 2.6, 4.5, 4.9, 1.6, 1.9, 5.6, 2.7, 3.3, 1.3, 1.2, 1.4, 4.9, 4.2, 4, 2.8, 4.3, 5.4, 5.1, 4.6, 5.1, 3.9, 3.1, 4.1, 3.6, 1.8, 1.5)

吟醸酒_都道府県_エキス分 <- c(4.97, 4.77, 4.78, 4.6, 4.83, 5.02, 4.94, 4.52, 5.03, 5.03, 4.62, 4.24, 4.72, 4.7, 4.82, 4.6, 5, 3.95, 4.77, 4.77, 4.4, 4.48, 4.92, 4.94, 4.46, 4.8, 4.76, 5, 4.98, 5.12, 4.42, 4.46, 4.57, 4.8, 4.5, 4.3, 4.46, 4.56, 4.5, 4.56, 4.95, 4.43, 4.63, 5.08, 5.17)

吟醸酒_都道府県_酸度 <- c(1.15, 1.13, 1.17, 1.1, 1.21, 1.16, 1.31, 1.28, 1.42, 1.42, 1.15, 1.24, 1.22, 1.26, 1.38, 1.27, 1.34, 1.08, 1.33, 1.2, 1.28, 1.38, 1.47, 1.42, 1.48, 1.43, 1.42, 1.22, 1.38, 1.38, 1.38, 1.42, 1.22, 1.36, 1.3, 1.35, 1.14, 1.36, 1.43, 1.22, 1.28, 1.14, 1.6, 1.48, 1.6)

吟醸酒_都道府県_アミノ酸度 <- c(1.17, 1.13, 0.82, 1.07, 0.91, 0.95, 1.1, 1.52, 1.4, 1.03, 1.23, 1.26, 1.34, 1.24, 1.1, 1.18, 1.24, 1.2, 1.1, 1.28, 1.3, 1.22, 1.4, 1.32, 1.24, 1.53, 1.28, 1.3, 1.45, 1.18, 1.6, 1.24, 1.28, 1.2, 1.17, 1.13, 1.06, 1.2, 1, 1.35, 1.25, 1.23, 1.61, 1.6, 1.49)

吟醸酒_都道府県_甘辛度 <- c(0.05, 0.06, 0.01, 0.01, -0.06, 0.09, -0.09, -0.31, -0.21, -0.16, -0.12, -0.36, -0.12, -0.23, -0.23, -0.22, -0.18, -0.29, -0.25, -0.04, -0.31, -0.47, -0.25, -0.23, -0.64, -0.32, -0.37, 0.06, -0.12, -0.14, -0.46, -0.44, -0.19, -0.25, -0.32, -0.47, -0.2, -0.42, -0.54, -0.19, -0.18, -0.11, -0.59, -0.3, -0.4)

吟醸酒_都道府県_濃淡度 <- c(-0.96, -1, -0.94, -1.1, -0.86, -0.91, -0.62, -0.81, -0.44, -0.41, -1.04, -0.94, -0.86, -0.83, -0.52, -0.81, -0.61, -1.31, -0.65, -0.88, -0.83, -0.65, -0.33, -0.44, -0.49, -0.45, -0.5, -0.79, -0.49, -0.49, -0.65, -0.54, -0.91, -0.6, -0.77, -0.73, -1.11, -0.67, -0.57, -0.9, -0.75, -1.06, -0.17, -0.31, -0.08)

# 茶、緑、青、その他色、R、紙
吟醸酒_容器比率 <- c(23.1, 49.5, 4.8, 22.0, 0.4, 0.4, 0)

# 精米歩合
吟醸酒_精米歩合_平均 <- 49.5
吟醸酒_精米歩合_標準偏差 <- 3.3

# 純米酒
純米酒_都道府県_アルコール分 <- c(15.22, 15.4, 15.28, 15.28, 15.08, 15.34, 16, 15.37, 15.62, 15.34, 15.1, 15.4, 15.65, 15.38, 15.82, 15.54, 15.63, 15.58, 15.64, 15.53, 15.36, 15.55, 15.27, 15.92, 15.76, 14.6, 15.5, 15.03, 16.47, 15.28, 15.52, 15.34, 15.18, 15.78, 15.52, 15.17, 15.9, 15.46, 15.44, 15.36, 15.51, 15.11, 15.34, 15.38, 15.3)

純米酒_都道府県_日本酒度 <- c(4.5, 1.3, 2.2, 4.7, 5.2, 2.8, 1.6, 4.1, 3, 4.2, 5.5, 3.1, 2.5, 4.8, 2.2, 3.8, 1.9, 5.2, 3.7, 5.2, 4.1, 5.6, 3.8, 3.9, 4.2, 4.8, 4.3, 5.4, 6, 3, 6.7, 6.2, 4.6, 4.3, 4, 7.1, 5.1, 2.8, 7.4, 3.1, 2, 0.5, 2.1, 2.3, 2.9)

純米酒_都道府県_エキス分 <- c(4.35, 4.98, 4.78, 4.32, 4.18, 4.7, 5.08, 4.46, 4.75, 4.46, 4.15, 4.64, 4.82, 4.33, 4.93, 4.58, 4.93, 4.28, 4.56, 4.3, 4.45, 4.24, 4.49, 4.64, 4.56, 4.12, 4.44, 4.14, 4.35, 4.64, 4.06, 4.06, 4.32, 4.54, 4.52, 3.87, 4.4, 4.72, 3.9, 4.64, 4.9, 5.04, 4.8, 4.78, 4.67)

純米酒_都道府県_酸度 <- c(1.47, 1.52, 1.33, 1.38, 1.37, 1.3, 1.33, 1.49, 1.52, 1.4, 1.25, 1.28, 1.45, 1.63, 1.43, 1.44, 1.33, 1.28, 1.64, 1.38, 1.48, 1.29, 1.44, 1.55, 1.54, 1.22, 1.38, 1.37, 1.75, 1.46, 1.46, 1.44, 1.38, 1.3, 1.46, 1.4, 1.4, 1.42, 1.46, 1.49, 1.6, 1.63, 1.62, 1.5, 1.73)

純米酒_都道府県_アミノ酸度 <- c(1.42, 1.46, 1.38, 1.08, 1.22, 1.26, 1.34, 1.47, 1.47, 1.2, 1.43, 1.44, 1.32, 1.58, 1.32, 1.62, 1.25, 1.2, 1.66, 1.53, 1.73, 1.51, 1.53, 1.57, 1.42, 1.4, 1.58, 1.44, 1.88, 1.24, 1.54, 1.36, 1.45, 1.56, 1.56, 1.13, 1.18, 1.44, 1.08, 1.42, 1.43, 1.6, 1.74, 1.85, 1.97)

純米酒_都道府県_甘辛度 <- c(-0.52, -0.29, -0.16, -0.45, -0.48, -0.18, -0.09, -0.52, -0.44, -0.42, -0.36, -0.18, -0.32, -0.75, -0.27, -0.43, -0.12, -0.38, -0.66, -0.5, -0.5, -0.43, -0.43, -0.57, -0.59, -0.27, -0.41, -0.5, -1, -0.38, -0.72, -0.66, -0.44, -0.32, -0.47, -0.69, -0.51, -0.32, -0.79, -0.43, -0.45, -0.34, -0.48, -0.36, -0.69)

純米酒_都道府県_濃淡度 <- c(-0.46, -0.22, -0.61, -0.63, -0.69, -0.7, -0.6, -0.41, -0.3, -0.58, -0.92, -0.75, -0.4, -0.17, -0.42, -0.49, -0.61, -0.85, -0.11, -0.65, -0.43, -0.85, -0.49, -0.29, -0.32, -0.94, -0.62, -0.69, 0, -0.41, -0.58, -0.59, -0.63, -0.77, -0.46, -0.71, -0.62, -0.48, -0.61, -0.36, -0.1, 0.02, -0.07, -0.3, 0.11)

# 茶、緑、青、その他色、R、紙
純米酒_容器比率 <- c(47.0, 42.4, 1.6, 4.6, 2.0, 2.3, 0)

# 精米歩合
純米酒_精米歩合_平均 <- 65.4
純米酒_精米歩合_標準偏差 <- 3.3

# 本醸造酒
本醸造酒_都道府県_アルコール分 <- c(14.98, 15.33, 15.13, 15.32, 15.37, 15.46, 15.36, 15.44, 15.36, 15.14, 15.25, 15.42, 15.5, 15.45, 15.42, 15.88, 15.67, 15.48, 15.22, 15.42, 15.1, 15.34, 14.84, 15.5, 15.1, 15.55, 15.64, 15.43, 15.26, 15.73, 15.27, 15.25, 15.38, 15.28, 15.42, 15.38, 15.73, 15.06, 15.26, 15.37, 15.64, 15.28, 14.82, 15.57, 15.35)

本醸造酒_都道府県_日本酒度 <- c(3.8, 4.6, 4.6, 5.4, 3.8, 1.9, 3.4, 5.4, 2.8, 2.6, 5.1, 5.2, 4, 7.1, 6.1, 5.7, 5, 6.1, 5.1, 6.7, 1.9, 5.2, 6.3, 2.5, 3.7, 3.9, 3.7, 4.7, 6.1, 4.7, 4.6, 4, 1.9, 5.3, 5, 5.1, 5.1, 5.8, 6.8, 3.9, 5, 5, 4, 3, 7.4)

本醸造酒_都道府県_エキス分 <- c(4.43, 4.35, 4.3, 4.22, 4.53, 4.89, 4.59, 4.24, 4.72, 4.69, 4.27, 4.28, 4.5, 3.93, 4.12, 4.32, 4.37, 4.1, 4.22, 3.98, 4.8, 4.24, 3.94, 4.8, 4.48, 4.58, 4.62, 4.39, 4.06, 4.45, 4.33, 4.43, 4.88, 4.24, 4.3, 4.3, 4.37, 4.08, 3.96, 4.5, 4.38, 4.33, 4.32, 4.72, 3.9)

本醸造酒_都道府県_酸度 <- c(1.25, 1.28, 0.98, 1.14, 1.25, 1.14, 1.21, 1.12, 1.1, 1.17, 1.2, 1.24, 1.35, 1.23, 1.16, 1.12, 1.12, 1.28, 1.32, 1.14, 1.25, 1.08, 1.26, 1.34, 1.25, 1.33, 1.22, 1.33, 1.3, 1.48, 1.43, 1.18, 1.22, 1.21, 1.34, 1.32, 1.33, 1.2, 1.32, 1.29, 1.32, 1.2, 1.18, 1.32, 1.25)

本醸造酒_都道府県_アミノ酸度 <- c(1.25, 1.28, 1, 0.88, 1.15, 1.1, 1.08, 1.4, 1.28, 1.34, 1.27, 1.29, 1.33, 1.25, 1.18, 1.46, 1.4, 1.3, 1.56, 1.24, 1.33, 1.28, 1.54, 1.56, 1.18, 1.25, 1.32, 1.4, 1.66, 1.33, 1.7, 1.13, 1.1, 1.21, 1.54, 1.24, 1.07, 1.34, 0.94, 1.45, 1.6, 1.28, 1.55, 1.85, 1.53)

本醸造酒_都道府県_甘辛度 <- c(-0.21, -0.31, 0.03, -0.23, -0.21, 0.09, -0.13, -0.21, 0.06, -0.01, -0.27, -0.33, -0.35, -0.5, -0.32, -0.23, -0.16, -0.47, -0.42, -0.35, -0.03, -0.15, -0.45, -0.19, -0.2, -0.3, -0.17, -0.38, -0.48, -0.55, -0.5, -0.15, 0, -0.3, -0.43, -0.41, -0.43, -0.34, -0.57, -0.26, -0.41, -0.26, -0.15, -0.22, -0.54)

本醸造酒_都道府県_濃淡度 <- c(-0.84, -0.83, -1.4, -1.12, -0.84, -0.96, -0.89, -1.16, -1.08, -0.93, -0.99, -0.92, -0.66, -1.02, -1.11, -1.17, -1.14, -0.88, -0.77, -1.18, -0.75, -1.23, -0.93, -0.61, -0.84, -0.7, -0.89, -0.73, -0.85, -0.46, -0.53, -0.99, -0.81, -0.98, -0.73, -0.77, -0.75, -1.03, -0.84, -0.77, -0.77, -0.99, -0.98, -0.68, -1)

# 茶、緑、青、その他色、R、紙
本醸造酒_容器比率 <- c(68.7, 20.3, 3.3, 5.7, 1.6, 0.4, 0)

# 精米歩合
本醸造酒_精米歩合_平均 <- 65.4
本醸造酒_精米歩合_標準偏差 <- 3.3

# タイプ別の出荷割合
# https://www.ssnp.co.jp/news/liquor/2018/02/2018-0207-1109-14.html
吟醸酒_出荷量 <- (22144 + 60450)
純米酒_出荷量 <- 59606
本醸造酒_出荷量 <- 35490
一般酒_出荷量 <- 394597 - (吟醸酒_出荷量 + 純米酒_出荷量 + 本醸造酒_出荷量)

一般酒_比率 <- 一般酒_出荷量 / (一般酒_出荷量 + 吟醸酒_出荷量 + 純米酒_出荷量 + 本醸造酒_出荷量)
吟醸酒_比率 <- 吟醸酒_出荷量 / (一般酒_出荷量 + 吟醸酒_出荷量 + 純米酒_出荷量 + 本醸造酒_出荷量)
純米酒_比率 <- 純米酒_出荷量 / (一般酒_出荷量 + 吟醸酒_出荷量 + 純米酒_出荷量 + 本醸造酒_出荷量)
本醸造酒_比率 <- 本醸造酒_出荷量 / (一般酒_出荷量 + 吟醸酒_出荷量 + 純米酒_出荷量 + 本醸造酒_出荷量)

# 一般酒データの生成
for (i in 1:length(都道府県)){
    都道府県 <- rep(都道府県名[i], 100)
    アルコール分 <- rnorm(100, mean = 一般酒_都道府県_アルコール分[i], sd = sd(一般酒_都道府県_アルコール分))
    日本酒度 <- rnorm(100, mean = 一般酒_都道府県_日本酒度[i], sd = sd(一般酒_都道府県_日本酒度))
    エキス分 <- rnorm(100, mean = 一般酒_都道府県_エキス分[i], sd = sd(一般酒_都道府県_エキス分))
    酸度 <- rnorm(100, mean = 一般酒_都道府県_酸度[i], sd = sd(一般酒_都道府県_酸度))
    アミノ酸度 <- rnorm(100, mean = 一般酒_都道府県_アミノ酸度[i], sd = sd(一般酒_都道府県_アミノ酸度))
    甘辛度 <- rnorm(100, mean = 一般酒_都道府県_甘辛度[i], sd = sd(一般酒_都道府県_甘辛度))
    濃淡度 <- rnorm(100, mean = 一般酒_都道府県_濃淡度[i], sd = sd(一般酒_都道府県_濃淡度))
    容器 <- sample(c("茶色瓶", "緑色瓶", "青色瓶", "その他色瓶", "リターナブル瓶", "紙パック", "その他"), 100, prob = 一般酒_容器比率, replace = TRUE)
    精米歩合 <- rnorm(100, mean = 一般酒_精米歩合_平均, sd = sd(一般酒_精米歩合_標準偏差))
}

一般酒_アルコール分 <- signif(rnorm(1000 * 一般酒_比率, mean = 一般酒_アルコール分_平均, sd = 一般酒_アルコール分_標準偏差), 3)
一般酒_日本酒度 <- signif(rnorm(1000 * 一般酒_比率, mean = 一般酒_日本酒度_平均, sd = 一般酒_日本酒度_標準偏差), 3)
一般酒_エキス分 <- signif(rnorm(1000 * 一般酒_比率, mean = 一般酒_エキス分_平均, sd = 一般酒_エキス分_標準偏差), 3)
一般酒_酸度 <- signif(rnorm(1000 * 一般酒_比率, mean = 一般酒_酸度_平均, sd = 一般酒_酸度_標準偏差), 3)
一般酒_アミノ酸度 <- signif(rnorm(1000 * 一般酒_比率, mean = 一般酒_アミノ酸度_平均, sd = 一般酒_アミノ酸度_標準偏差), 3)
一般酒_甘辛度 <- round(rnorm(1000 * 一般酒_比率, mean = 一般酒_甘辛度_平均, sd = 一般酒_甘辛度_標準偏差), 3)
一般酒_濃淡度 <- signif(rnorm(1000 * 一般酒_比率, mean = 一般酒_濃淡度_平均, sd = 一般酒_濃淡度_標準偏差), 3)
一般酒_容器 <- sample(c("茶色瓶", "緑色瓶", "青色瓶", "その他色瓶", "リターナブル瓶", "紙パック", "その他"), 1000 * 一般酒_比率, prob = 一般酒_容器比率, replace = TRUE)
一般酒_精米歩合 <- signif(rnorm(1000 * 一般酒_比率, mean = (一般酒_精米歩合_最低 + 一般酒_精米歩合_最高) / 2, sd = (一般酒_精米歩合_最低 - 一般酒_精米歩合_最高) / 4), 2)
一般酒 <- cbind.data.frame(アルコール分 = 一般酒_アルコール分, 日本酒度 = 一般酒_日本酒度, エキス分 = 一般酒_エキス分, 酸度 = 一般酒_酸度, アミノ酸度 = 一般酒_アミノ酸度, 甘辛度 = 一般酒_甘辛度, 濃淡度 = 一般酒_濃淡度, 精米歩合 = 一般酒_精米歩合, 容器 = 一般酒_容器, タイプ = rep("一般酒", length(一般酒_アルコール分)))

# 吟醸酒データの生成
吟醸酒_アルコール分 <- signif(rnorm(1000 * 吟醸酒_比率, mean = 吟醸酒_アルコール分_平均, sd = 吟醸酒_アルコール分_標準偏差), 3)
吟醸酒_日本酒度 <- signif(rnorm(1000 * 吟醸酒_比率, mean = 吟醸酒_日本酒度_平均, sd = 吟醸酒_日本酒度_標準偏差), 3)
吟醸酒_エキス分 <- signif(rnorm(1000 * 吟醸酒_比率, mean = 吟醸酒_エキス分_平均, sd = 吟醸酒_エキス分_標準偏差), 3)
吟醸酒_酸度 <- signif(rnorm(1000 * 吟醸酒_比率, mean = 吟醸酒_酸度_平均, sd = 吟醸酒_酸度_標準偏差), 3)
吟醸酒_アミノ酸度 <- signif(rnorm(1000 * 吟醸酒_比率, mean = 吟醸酒_アミノ酸度_平均, sd = 吟醸酒_アミノ酸度_標準偏差), 3)
吟醸酒_甘辛度 <- round(rnorm(1000 * 吟醸酒_比率, mean = 吟醸酒_甘辛度_平均, sd = 吟醸酒_甘辛度_標準偏差), 3)
吟醸酒_濃淡度 <- signif(rnorm(1000 * 吟醸酒_比率, mean = 吟醸酒_濃淡度_平均, sd = 吟醸酒_濃淡度_標準偏差), 3)
吟醸酒_容器 <- sample(c("茶色瓶", "緑色瓶", "青色瓶", "その他色瓶", "リターナブル瓶", "紙パック", "その他"), 1000 * 吟醸酒_比率, prob = 吟醸酒_容器比率, replace = TRUE)
吟醸酒_精米歩合 <- signif(rnorm(1000 * 吟醸酒_比率, mean = (吟醸酒_精米歩合_最低 + 吟醸酒_精米歩合_最高) / 2, sd = (吟醸酒_精米歩合_最低 - 吟醸酒_精米歩合_最高) / 4), 2)
吟醸酒 <- cbind.data.frame(アルコール分 = 吟醸酒_アルコール分, 日本酒度 = 吟醸酒_日本酒度, エキス分 = 吟醸酒_エキス分, 酸度 = 吟醸酒_酸度, アミノ酸度 = 吟醸酒_アミノ酸度, 甘辛度 = 吟醸酒_甘辛度, 濃淡度 = 吟醸酒_濃淡度, 精米歩合 = 吟醸酒_精米歩合, 容器 = 吟醸酒_容器, タイプ = rep("吟醸酒", length(吟醸酒_アルコール分)))

# 純米酒データの生成
純米酒_アルコール分 <- signif(rnorm(1000 * 純米酒_比率, mean = 純米酒_アルコール分_平均, sd = 純米酒_アルコール分_標準偏差), 3)
純米酒_日本酒度 <- signif(rnorm(1000 * 純米酒_比率, mean = 純米酒_日本酒度_平均, sd = 純米酒_日本酒度_標準偏差), 3)
純米酒_エキス分 <- signif(rnorm(1000 * 純米酒_比率, mean = 純米酒_エキス分_平均, sd = 純米酒_エキス分_標準偏差), 3)
純米酒_酸度 <- signif(rnorm(1000 * 純米酒_比率, mean = 純米酒_酸度_平均, sd = 純米酒_酸度_標準偏差), 3)
純米酒_アミノ酸度 <- signif(rnorm(1000 * 純米酒_比率, mean = 純米酒_アミノ酸度_平均, sd = 純米酒_アミノ酸度_標準偏差), 3)
純米酒_甘辛度 <- round(rnorm(1000 * 純米酒_比率, mean = 純米酒_甘辛度_平均, sd = 純米酒_甘辛度_標準偏差), 3)
純米酒_濃淡度 <- signif(rnorm(1000 * 純米酒_比率, mean = 純米酒_濃淡度_平均, sd = 純米酒_濃淡度_標準偏差), 3)
純米酒_容器 <- sample(c("茶色瓶", "緑色瓶", "青色瓶", "その他色瓶", "リターナブル瓶", "紙パック", "その他"), 1000 * 純米酒_比率, prob = 純米酒_容器比率, replace = TRUE)
純米酒_精米歩合 <- signif(rnorm(1000 * 純米酒_比率, mean = (純米酒_精米歩合_最低 + 純米酒_精米歩合_最高) / 2, sd = (純米酒_精米歩合_最低 - 純米酒_精米歩合_最高) / 4), 2)
純米酒 <- cbind.data.frame(アルコール分 = 純米酒_アルコール分, 日本酒度 = 純米酒_日本酒度, エキス分 = 純米酒_エキス分, 酸度 = 純米酒_酸度, アミノ酸度 = 純米酒_アミノ酸度, 甘辛度 = 純米酒_甘辛度, 濃淡度 = 純米酒_濃淡度, 精米歩合 = 純米酒_精米歩合, 容器 = 純米酒_容器, タイプ = rep("純米酒", length(純米酒_アルコール分)))

# 本醸造酒データの生成
本醸造酒_アルコール分 <- signif(rnorm(1000 * 本醸造酒_比率, mean = 本醸造酒_アルコール分_平均, sd = 本醸造酒_アルコール分_標準偏差), 3)
本醸造酒_日本酒度 <- signif(rnorm(1000 * 本醸造酒_比率, mean = 本醸造酒_日本酒度_平均, sd = 本醸造酒_日本酒度_標準偏差), 3)
本醸造酒_エキス分 <- signif(rnorm(1000 * 本醸造酒_比率, mean = 本醸造酒_エキス分_平均, sd = 本醸造酒_エキス分_標準偏差), 3)
本醸造酒_酸度 <- signif(rnorm(1000 * 本醸造酒_比率, mean = 本醸造酒_酸度_平均, sd = 本醸造酒_酸度_標準偏差), 3)
本醸造酒_アミノ酸度 <- signif(rnorm(1000 * 本醸造酒_比率, mean = 本醸造酒_アミノ酸度_平均, sd = 本醸造酒_アミノ酸度_標準偏差), 3)
本醸造酒_甘辛度 <- round(rnorm(1000 * 本醸造酒_比率, mean = 本醸造酒_甘辛度_平均, sd = 本醸造酒_甘辛度_標準偏差), 3)
本醸造酒_濃淡度 <- signif(rnorm(1000 * 本醸造酒_比率, mean = 本醸造酒_濃淡度_平均, sd = 本醸造酒_濃淡度_標準偏差), 3)
本醸造酒_容器 <- sample(c("茶色瓶", "緑色瓶", "青色瓶", "その他色瓶", "リターナブル瓶", "紙パック", "その他"), 1000 * 本醸造酒_比率, prob = 本醸造酒_容器比率, replace = TRUE)
本醸造酒_精米歩合 <- signif(rnorm(1000 * 本醸造酒_比率, mean = (本醸造酒_精米歩合_最低 + 本醸造酒_精米歩合_最高) / 2, sd = (本醸造酒_精米歩合_最低 - 本醸造酒_精米歩合_最高) / 4), 2)
本醸造酒 <- cbind.data.frame(アルコール分 = 本醸造酒_アルコール分, 日本酒度 = 本醸造酒_日本酒度, エキス分 = 本醸造酒_エキス分, 酸度 = 本醸造酒_酸度, アミノ酸度 = 本醸造酒_アミノ酸度, 甘辛度 = 本醸造酒_甘辛度, 濃淡度 = 本醸造酒_濃淡度, 精米歩合 = 本醸造酒_精米歩合, 容器 = 本醸造酒_容器, タイプ = rep("本醸造酒", length(本醸造酒_アルコール分)))

# 全データの結合と保存
日本酒データ <- rbind.data.frame(一般酒, 吟醸酒, 純米酒, 本醸造酒)
readr::write_excel_csv(日本酒データ, "large_pseudo_sake_data.csv")